package com.jr;

/**
 * 响应码
 *
 */
public enum ResponseCode {
    //订单错误码
    CODE_101(101, "自提商品和非自提商品，需分开购买！", "自提商品和非自提商品，需分开购买！"),
    CODE_102(102, "不同店铺的自提商品，需分开购买！", "不同店铺的自提商品，需分开购买！"),
    CODE_103(103, "不同币种的商品，需分开购买！", "不同币种的商品，需分开购买！"),
    CODE_104(104, "购物车无商品，请重新选择!", "购物车无商品，请重新选择!"),
    CODE_105(105, "订单确认失败，优惠券信息错误！", "订单确认失败，优惠券信息错误！"),
    CODE_106(106, "订单不存在!", "订单不存在!"),
    CODE_107(107, "订单确认失败，库存不足!", "订单确认失败，库存不足!"),
    CODE_108(108, "退款单id不正确", "退款单id不正确"),
    CODE_109(109, "不是待收货状态，无法确认收货", "不是待收货状态，无法确认收货"),
    //成功
    CODE_200(200, "成功", "成功！"),
    //公共错误码
    CODE_403(403, "您还没有登陆，请先登陆!", "您还没有登陆，请先登陆!"),
    //优惠券
    CODE_450(450, "此优惠券不存在", "此优惠券不存在！"),
    CODE_451(451, "优惠券活动已结束，不可以领取", "优惠券活动已结束，不可以领取！"),
    CODE_452(452, "优惠券已终止，不可以领取", "优惠券已终止，不可以领取！"),
    CODE_453(453, "优惠券已过期，不可以领取", "优惠券已过期，不可以领取！"),
    CODE_454(454, "活动还没有开始，不可以领取", "活动还没有开始，不可以领取！"),
    CODE_455(455, "人不可以太贪心哦，你已经领取了！", "人不可以太贪心哦，你已经领取了！"),
    CODE_456(456, "优惠券已被领完", "优惠券已被领完"),
    CODE_457(457, "领取优惠券失败", "领取优惠券失败"),
    //商品评价错误码
    CODE_460(460, "商品评价查询失败", "商品评价查询失败"),
    CODE_461(461, "商品评价加载失败！", "商品评价加载失败！"),
    CODE_462(462, "添加评论的参数为空，评论失败", "评论失败！"),
    CODE_463(463, "订单查询失败，添加评论失败", "订单查询失败，添加评论失败"),
    CODE_464(464, "已经超过评价时间，添加评论失败", "已经超过评价时间，添加评论失败"),
    CODE_465(465, "已经评价过，添加评论失败", "已经评价过，添加评论失败"),
    CODE_466(466, "已经进行过追加评论，添加评论失败", "已经进行过追加评论，添加评论失败"),


    //店铺专区
    CODE_480(480, "请输入类目ID。", "加载失败！"),
    CODE_481(481, "请上传店铺ID", "加载失败！"),
    //退货物流
    CODE_501(501, "退货订单、物流单、快递公司名不能为空", "退货订单、物流单、快递公司名不能为空!"),
    Code_502(502, "请匆重复提交", "请匆重复提交!"),
    Code_503(503, "保存退货物流订单失败", "保存退货物流订单失败！"),
    //查询订单物流
    Code_504(504, "订单id不能为空", "订单加载失败！"),
    Code_505(505, "未查到订单信息，请确认订单是否存在", "没有查到订单信息，请确认订单是否存在！"),
    //退款提示
    CODE_506(506, "退款理由为空", "退款理由为空"),
    CODE_507(507, "退款类型异常", "退款类型异常"),
    CODE_508(508, "退款金额不能为空，且必须是数字", "退款金额不能为空，且必须是数字"),

    //个人中心
    CODE_520(520, "自提地址查询，店铺ID不能为空", "自提地址加载失败！"),
    CODE_521(521, "要设置默认地址ID不能为空", "默认地址设置失败！"),
    CODE_522(522, "设置默认地址失败。", "默认地址设置失败！"),
    CODE_523(523, "请选择要删除的收货地址ID不能为空。", "请选择要删除的收货地址ID不能为空。"),
    CODE_524(524, "上传的收货地址ID不属于本人，请确定要删除的收货地址ID是否正确。", "收货地址删除失败！"),
    CODE_525(525, "上传的收货地址ID不属于本人，请确定要修改的收货地址ID是否正确。", "收货地址更新失败！"),
    CODE_526(526, "省编号不能为空", "选择地区失败！"),
    CODE_527(527, "市编号不能为空", "选择地区失败！"),
    CODE_528(528, "县、县级市、区编号不能为空", "选择地区失败！"),
    CODE_529(529, "联系人手机不能为空", "联系人手机不能为空！"),
    CODE_530(530, "详细地址不能为空", "详细地址不能为空！"),
    CODE_531(531, "收货人不能为空", "收货人不能为空！"),
    CODE_532(532, "更新站内信状态失败", "通知消息加载失败！"),
    CODE_533(533, "请上传站内信ID", "通知消息加载失败！"),
    //商品详情错误码
    CODE_701(701, "该商品已被删除", "该商品已被删除"),
    CODE_702(702, "优惠券信息查询失败", "优惠券加载失败！"),
    CODE_726(726, "商品规格查询失败", "商品规格加载失败！"),
    CODE_727(727, "商品介绍查询失败", "商品介绍加载失败！"),
    CODE_728(728, "商品参数查询失败", "商品参数加载失败！"),
    CODE_729(729, "商品店铺信息查询失败", "商品店铺信息加载失败！"),
    CODE_730(730, "商品详情同类型商品推荐查询失败", "商品详情同类型商品推荐查询失败!"),
    CODE_731(731, "商品购买须知查询失败", "商品购买须知查询加载失败！"),
    //系统错误码
    CODE_999(999, "系统异常,请稍后再试！", "系统异常,请稍后再试！"),
    //购物车错误码
    CODE_601(601, "商品skuId不能为空", "购物车加载失败！"),
    CODE_602(602, "商品数量不能为空", "购物车加载失败！"),
    CODE_603(603, "商品sku信息不能为空", "购物车加载失败！"),
    CODE_604(604, "您购买的商品库存不足", "您购买的商品库存不足！"),
    CODE_605(605, "加入商品到购物车失败", "加入购物车失败！"),
    CODE_606(606, "查询购物车商品信息失败", "购物车加载失败！"),
    CODE_607(607, "更新购物车商品信息失败", "购物车加载失败！"),
    CODE_608(608, "查询购物车有效商品失败", "购物车加载失败！"),
    CODE_609(609, "查询购物车失效商品失败", "购物车加载失败！"),
    CODE_610(610, "商品移至收藏夹失败", "商品移至收藏夹失败！"),
    CODE_611(611, "删除购物车商品失败", "删除购物车商品失败！"),
    CODE_612(612, "查询已关闭订单详情失败", "加入购物车失败！"),
    CODE_613(613, "加入已关闭订单商品到购物车失败", "加入购物车失败！"),
    CODE_614(614, "查询购物车店铺优惠卷，店铺ID不能为空", "优惠券加载失败！"),
    CODE_615(615, "查询购物车店铺优惠卷失败", "优惠券加载失败！"),
    CODE_616(616, "购物车商品分单提示失败", "商品分单结算异常！"),
    CODE_617(617, "购物车商品分单提示，更新商品选中状态失败", "商品分单结算异常！"),
    CODE_618(618, "计算购物车优惠卷商品金额，优惠卷ID不能为空", "优惠券计算异常！"),
    CODE_619(619, "计算购物车优惠卷商品金额失败", "优惠券计算异常！");

    private Integer code;

    private String des;//前端展示的错误信息

    private String sysDes;//后台开发的错误信息

    ResponseCode(Integer code, String sysDes, String des) {
        this.code = code;
        this.sysDes = sysDes;
        this.des = des;
    }

    public Integer getCode() {
        return code;
    }

    public void setCode(Integer code) {
        this.code = code;
    }

    public String getDes() {
        return des;
    }

    public String getSysDes() {
        return sysDes;
    }

    public void setSysDes(String sysDes) {
        this.sysDes = sysDes;
    }
}
